In [1]:
import pandas as pd
import env
import os
import seaborn as sns
import acquire
import prepare

# In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data.

# Create a pandas dataframe, df_iris, from this data.

In [2]:
df_iris = sns.load_dataset("iris")

print the first 3 rows

In [3]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

print the number of rows and columns (shape)

In [4]:
df_iris.shape

(150, 5)

print the column names

In [5]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

print the data type of each column

In [6]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

print the summary statistics for each of the numeric variables.

In [7]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Would you recommend rescaling the data based on these statistics?

It does not appear rescaling is necessary

# Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel

In [8]:
df_excel = pd.read_excel('Excel_Exercises.xlsx')

assign the first 100 rows to a new dataframe, df_excel_sample

In [9]:
df_excel_sample = df_excel.head(100)

print the number of rows of your original dataframe

In [10]:
print('df_excel has',len(df_excel),'rows')

df_excel has 7049 rows

print the first 5 column names

In [11]:
print(df_excel.columns[0:5])

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

print the column names that have a data type of object

In [12]:
df_excel.select_dtypes(include='object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

compute the range for each of the numeric variables.

In [13]:
# create series with only the columns containing numbers, and their minimum/maximum values
mins = df_excel.select_dtypes(include='float64').min()
maxes = df_excel.select_dtypes(include='float64').max()

ranges = pd.concat([mins, maxes], axis=1)
ranges.columns =['min_value', 'max_value']
ranges.insert(2, "Range", ranges.max_value - ranges.min_value , True)
ranges

                   min_value  max_value   Range
is_senior_citizen       0.00       1.00     1.0
phone_service           0.00       2.00     2.0
internet_service        0.00       2.00     2.0
contract_type           0.00       2.00     2.0
monthly_charges        18.25     118.75   100.5
total_charges          18.80    8684.80  8666.0

# Read the data from this google sheet into a dataframe, df_google

print the first three rows

In [14]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_import_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google = pd.read_csv(csv_import_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Print the number of rows and columns

In [15]:
df_google.shape

(891, 12)

Print the column names

In [16]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Print the datatype of each column

In [17]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

print the summary statistics for each of the numeric variables

In [18]:
df_excel.select_dtypes(include=['int64', 'float64']).describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000

Print the unique values for each of your categorical variables

In [19]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [20]:
print("Unique values from 'Survived':",df_google['Survived'].unique())
print("Unique values from 'Pclass':",df_google['Pclass'].unique())
print("Unique values from 'Sex':",df_google['Sex'].unique())
print("Unique values from 'Embarked':",df_google['Embarked'].unique())

Unique values from 'Survived': [0 1]
Unique values from 'Pclass': [3 1 2]
Unique values from 'Sex': ['male' 'female']
Unique values from 'Embarked': ['S' 'C' 'Q' nan]

In [21]:
# testing data acquisition functions from acquire.py file I created
acquire.get_titanic_data()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [22]:
acquire.get_iris_data()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...,...
145,3,146,6.7,3.0,5.2,2.3,virginica
146,3,147,6.3,2.5,5.0,1.9,virginica
147,3,148,6.5,3.0,5.2,2.0,virginica
148,3,149,6.2,3.4,5.4,2.3,virginica
149,3,150,5.9,3.0,5.1,1.8,virginica

In [23]:
acquire.get_telco_data()

,internet_service_type_id,customer_id,contract_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,monthly_charges,total_charges,churn,contract_type,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,internet_service_type
0,1,0002-ORFBO,2,Female,0,Yes,Yes,9,Yes,No,...,65.60,593.3,No,One year,2,Yes,2,65.60,593.3,DSL
1,1,0003-MKNFE,1,Male,0,No,No,9,Yes,Yes,...,59.90,542.4,No,Month-to-month,1,No,2,59.90,542.4,DSL
2,2,0004-TLHLJ,1,Male,0,No,No,4,Yes,No,...,73.90,280.85,Yes,Month-to-month,1,Yes,1,73.90,280.85,Fiber optic
3,2,0011-IGKFF,1,Male,1,Yes,No,13,Yes,No,...,98.00,1237.85,Yes,Month-to-month,1,Yes,1,98.00,1237.85,Fiber optic
4,2,0013-EXCHZ,1,Female,1,Yes,No,3,Yes,No,...,83.90,267.4,Yes,Month-to-month,1,Yes,2,83.90,267.4,Fiber optic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,9282-IZGQK,1,Female,0,No,No,1,Yes,Yes,...,85.00,85,Yes,Month-to-month,1,Yes,1,85.00,85,Fiber optic
7039,1,9462-MJUAW,1,Male,0,No,No,4,Yes,Yes,...,50.40,206.6,Yes,Month-to-month,1,No,2,50.40,206.6,DSL
7040,1,9705-ZJBCG,2,Female,0,Yes,Yes,13,Yes,No,...,54.15,701.05,No,One year,2,No,3,54.15,701.05,DSL
7041,2,9777-IQHWP,3,Male,0,Yes,Yes,64,Yes,Yes,...,93.40,5822.3,No,Two year,3,No,3,93.40,5822.3,Fiber optic
7042,2,9809-IMGCQ,1,Male,1,No,No,22,Yes,Yes,...,96.70,2082.95,Yes,Month-to-month,1,Yes,1,96.70,2082.95,Fiber optic

The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

Using the Iris Data:

Use the function defined in acquire.py to load the iris data.

Drop the species_id and measurement_id columns.

Rename the species_name column to just species.

Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [25]:
# load the iris data using our function in the acquire file
iris_df = acquire.get_iris_data()

In [26]:
# verify that it loaded and show the first few lines of data
iris_df.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [27]:
# Drop the species_id and measurement_id columns
iris_df = iris_df.drop(columns=['species_id','measurement_id'])
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

In [28]:
# rename the species_name column to species

iris_df.rename(columns = {'species_name':'species'}, inplace = True)
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [29]:
iris_df.species.value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [32]:
# Create dummy variables of the species name    
dummy_df = pd.get_dummies(iris_df['species'], dummy_na=False, drop_first=False)

# concatenate onto the iris dataframe.
iris_df = pd.concat([iris_df, dummy_df], axis=1)
iris_df.head(1)

,sepal_length,sepal_width,petal_length,petal_width,species,setosa,versicolor,virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0

In [33]:
# Create a function named prep_iris that accepts the untransformed iris data, 
# and returns the data with the transformations above applied.

def prep_iris(df):
    # Drop the species_id and measurement_id columns
    df = df.drop(columns=['species_id','measurement_id'])
    
    # rename the species_name column to species
    df.rename(columns = {'species_name':'species'}, inplace = True)
    
    # Create dummy variables of the species name    
    dummy_df = pd.get_dummies(df['species'], dummy_na=False, drop_first=False)

    # concatenate onto the iris dataframe.
    df = pd.concat([df, dummy_df], axis=1)
    
    # return the converted iris dataframe
    return df

Using the Titanic dataset

Use the function defined in acquire.py to load the Titanic data.

Drop any unnecessary, unhelpful, or duplicated columns.

Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [34]:
df = acquire.get_titanic_data()

In [35]:
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [36]:
# Drop unnecessary columns (pclass)
df = df.drop(columns=['pclass'])
df.head()

,passenger_id,survived,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [39]:
# Create dummy variables of the categorical columns   
dummy_df = pd.get_dummies(df[['sex','class','embark_town']], dummy_na=False, drop_first=False)

# concatenate onto the titanic dataframe.
df = pd.concat([df, dummy_df], axis=1)
df.head()

,passenger_id,survived,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
0,0,0,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0,0,1,0,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0,1,0,1,0,0,1,0,0
2,2,1,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1,1,0,0,0,1,0,0,1
3,3,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0,1,0,1,0,0,0,0,1
4,4,0,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1,0,1,0,0,1,0,0,1

Use the function defined in acquire.py to load the Telco data.

Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [47]:
df = acquire.get_telco_data()
df.columns

Index(['internet_service_type_id', 'customer_id', 'contract_type_id', 'gender',
       'senior_citizen', 'partner', 'dependents', 'tenure', 'phone_service',
       'multiple_lines', 'online_security', 'online_backup',
       'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies',
       'paperless_billing', 'payment_type_id', 'monthly_charges',
       'total_charges', 'churn', 'contract_type', 'contract_type_id.1',
       'paperless_billing.1', 'payment_type_id.1', 'monthly_charges.1',
       'total_charges.1', 'internet_service_type'],
      dtype='object')

In [48]:
# Drop any unnecessary, unhelpful, or duplicated columns. 
df = df.drop(columns=['contract_type_id','internet_service_type_id', 'payment_type_id', 'contract_type_id.1',
                      'payment_type_id.1', 'monthly_charges.1','total_charges.1','paperless_billing.1',])

In [50]:
# Encode the categorical columns. 
# Create dummy variables of the categorical columns and concatenate them onto the dataframe.

# Create dummy variables of the categorical columns  
dummy_df = pd.get_dummies(df[['gender','contract_type','internet_service_type']], dummy_na=False, drop_first=False)

# concatenate onto the telco dataframe.
df = pd.concat([df, dummy_df], axis=1)
df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,contract_type,internet_service_type,gender_Female,gender_Male,contract_type_Month-to-month,contract_type_One year,contract_type_Two year,internet_service_type_DSL,internet_service_type_Fiber optic,internet_service_type_None
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,One year,DSL,1,0,0,1,0,1,0,0
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,Month-to-month,DSL,0,1,1,0,0,1,0,0
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,Month-to-month,Fiber optic,0,1,1,0,0,0,1,0
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,Month-to-month,Fiber optic,0,1,1,0,0,0,1,0
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Month-to-month,Fiber optic,1,0,1,0,0,0,1,0

In [2]:
# testing functions in prepare.py

In [3]:
i_df = acquire.get_iris_data()
i_df = prepare.prep_iris(i_df)
i_df.head()

,sepal_length,sepal_width,petal_length,petal_width,species,setosa,versicolor,virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0

In [4]:
t_df = acquire.get_titanic_data()
t_df = prepare.prep_titanic(t_df)
t_df.head()

,passenger_id,survived,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
0,0,0,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0,0,1,0,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0,1,0,1,0,0,1,0,0
2,2,1,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1,1,0,0,0,1,0,0,1
3,3,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0,1,0,1,0,0,0,0,1
4,4,0,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1,0,1,0,0,1,0,0,1

In [2]:
tel_df = acquire.get_telco_data()
tel_df = prepare.prep_telco(tel_df)
tel_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,contract_type,internet_service_type,gender_Female,gender_Male,contract_type_Month-to-month,contract_type_One year,contract_type_Two year,internet_service_type_DSL,internet_service_type_Fiber optic,internet_service_type_None
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,One year,DSL,1,0,0,1,0,1,0,0
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,Month-to-month,DSL,0,1,1,0,0,1,0,0
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,Month-to-month,Fiber optic,0,1,1,0,0,0,1,0
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,Month-to-month,Fiber optic,0,1,1,0,0,0,1,0
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Month-to-month,Fiber optic,1,0,1,0,0,0,1,0